app/controllers/places_controller.rb

  def index
    radius = params[:radius] || 20

    if params[:type].nil?
      places = Place.within(radius, :origin => [params[:latitude],params[:longitude]]).limit(20)
---
SELECT  "places".* FROM "places" INNER JOIN "places_types" ON "places_types"."place_id" = "places"."id" WHERE ((