app/controllers/places_controller.rb

SELECT  "places".* FROM "places" WHERE ((
SELECT  "types".* FROM "types" WHERE "types"."name" = $1 LIMIT 1  [["name", "museum"]]
SELECT "places_types"."place_id" FROM "places_types" WHERE "places_types"."type_id" = 4
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "photos".* FROM "photos" WHERE "photos"."place_id" = $1  [["place_id", 1]]
SELECT "types".* FROM "types" INNER JOIN "places_types" ON "types"."id" = "places_types"."type_id" WHERE "places_types"."place_id" = $1  [["place_id", 1]]
---
  def index
    if params[:type].nil?
      places = Place.all
    else
      type_id = Type.find_by(name: params[:type])
      place_ids = PlacesType.where(type_id: type_id).pluck(:place_id)
      places = Place.find(place_ids)
    end
    result = places.map do |place|
      {
        name: place.name,
        description: place.description,
        photos: place.photos.map {|photo| photo.image_url},
        rating: place.rating,
        duration: place.duration,
        price: place.price,
        longitude: place.longitude,
        latitude: place.latitude,
        types: place.types.map {|type| type.name}

SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    place = Place.find(params[:id])

INSERT INTO "places" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test"], ["description", "testtest"], ["created_at", "2016-06-29 18:19:35.087839"], ["updated_at", "2016-06-29 18:19:35.087839"]]
---
  def create
    info = {
      name: params[:name],
      description: params[:description],
      rating: params[:rating],
      duration: params[:duration],
      price: params[:price],
      longitude: params[:longitude],
      latitude: params[:latitude],
    }
    new_place = Place.new(info)
    if new_place.save