app/controllers/types_controller.rb

SELECT "types".* FROM "types"
SELECT "types"."name" FROM "types"
---
  def index
    @types = Type.all
    render json: @types.pluck(:name).to_json