app/controllers/wishlists_controller.rb

SELECT "wishlists".* FROM "wishlists" WHERE "wishlists"."user_id" = $1  [["user_id", 1]]
---
  def index
    wishlists = Wishlist.all.where(user_id: params[:user_id])

SELECT  "wishlists".* FROM "wishlists" WHERE "wishlists"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "places_wishlists"."place_id" FROM "places_wishlists" WHERE "places_wishlists"."wishlist_id" = $1 AND "places_wishlists"."liked" = $2  [["wishlist_id", 1], ["liked", "t"]]
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    wishlist = Wishlist.find(params[:id])
    if wishlist.user_id == params[:user_id]
      liked_places_ids = wishlist.places_wishlists.where(liked: true).pluck(:place_id)
      liked_places = Place.find(liked_places_ids)